# IFCProperty Set Mapping Info Methods

Source: https://www.revitapidocs.com/2026/563b86bc-2246-fe4f-9d94-74485e21dc2d.htm

---

| IFCProperty Set Mapping Info Methods |
| --- |

The IFCPropertySetMappingInfo type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

IFCPropertySetMappingInfo Class Autodesk.Revit.DB Namespace